---
kind: method
id: M:Autodesk.Revit.DB.SweptProfile.GetSweptProfile
source: html/b09a4a81-a2b8-4d9b-9ac8-3b983ebb3115.htm
---
# Autodesk.Revit.DB.SweptProfile.GetSweptProfile Method

Returns an object that describes the profile that is swept along the driving curve.

## Syntax (C#)
```csharp
public Profile GetSweptProfile()
```

## Returns
A geometric profile object.

## Remarks
The profile is swept perpendicular to the driving curve.